# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import pandas as pd
import sqlite3

In [5]:
curr = sqlite3.connect('data.sqlite')
c = curr.cursor()

In [6]:
df = pd.DataFrame(
    c.execute("""
    SELECT *
    FROM sqlite_master 
    WHERE type='table';
""").fetchall()
)
df.columns = [x[0] for x in c.description]
c.description
df

,type,name,tbl_name,rootpage,sql
0,table,orderdetails,orderdetails,2,"CREATE TABLE `orderdetails` (`orderNumber`, `p..."
1,table,payments,payments,28,"CREATE TABLE `payments` (`customerNumber`, `ch..."
2,table,offices,offices,32,"CREATE TABLE `offices` (`officeCode`, `city`, ..."
3,table,customers,customers,33,"CREATE TABLE `customers` (`customerNumber`, `c..."
4,table,orders,orders,38,"CREATE TABLE `orders` (`orderNumber`, `orderDa..."
5,table,productlines,productlines,46,"CREATE TABLE `productlines` (`productLine`, `t..."
6,table,products,products,47,"CREATE TABLE `products` (`productCode`, `produ..."
7,table,employees,employees,56,"CREATE TABLE `employees` (`employeeNumber`, `l..."

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [16]:
df = pd.DataFrame(c.execute("""
SELECT employeeNumber, lastName, firstName, employees.officeCode
FROM employees

;
""").fetchall())
df.columns = [x[0] for x in c.description]
df

   employeeNumber   lastName firstName officeCode
0            1002     Murphy     Diane          1
1            1056  Patterson      Mary          1
2            1076   Firrelli      Jeff          1
3            1088  Patterson   William          6
4            1102     Bondur    Gerard          4
5            1143        Bow   Anthony          1
6            1165   Jennings    Leslie          1
7            1166   Thompson    Leslie          1
8            1188   Firrelli     Julie          2
9            1216  Patterson     Steve          2
10           1286      Tseng  Foon Yue          3
11           1323     Vanauf    George          3
12           1337     Bondur      Loui          4
13           1370  Hernandez    Gerard          4
14           1401   Castillo    Pamela          4
15           1501       Bott     Larry          7
16           1504      Jones     Barry          7
17           1611     Fixter      Andy          6
18           1612      Marsh     Peter          6
19           1619       King       Tom          6
20           1621      Nishi      Mami          5
21           1625       Kato   Yoshimi          5
22           1702     Gerard    Martin          4

In [ ]:
Hint: Combine the employees and offices tables and use a group by.

In [15]:
df = pd.DataFrame(c.execute("""
SELECT employeeNumber, lastName, firstName, employees.officeCode, offices.officeCode
FROM employees
JOIN offices
USING (officeCode) ;
""").fetchall())
df.columns = [x[0] for x in c.description]
df

   employeeNumber   lastName firstName officeCode officeCode
0            1002     Murphy     Diane          1          1
1            1056  Patterson      Mary          1          1
2            1076   Firrelli      Jeff          1          1
3            1088  Patterson   William          6          6
4            1102     Bondur    Gerard          4          4
5            1143        Bow   Anthony          1          1
6            1165   Jennings    Leslie          1          1
7            1166   Thompson    Leslie          1          1
8            1188   Firrelli     Julie          2          2
9            1216  Patterson     Steve          2          2
10           1286      Tseng  Foon Yue          3          3
11           1323     Vanauf    George          3          3
12           1337     Bondur      Loui          4          4
13           1370  Hernandez    Gerard          4          4
14           1401   Castillo    Pamela          4          4
15           1501       Bott     Larry          7          7
16           1504      Jones     Barry          7          7
17           1611     Fixter      Andy          6          6
18           1612      Marsh     Peter          6          6
19           1619       King       Tom          6          6
20           1621      Nishi      Mami          5          5
21           1625       Kato   Yoshimi          5          5
22           1702     Gerard    Martin          4          4

## Do any offices have no employees?

In [72]:
df = pd.DataFrame(c.execute("""
SELECT employeeNumber, lastName, firstName, employees.officeCode, offices.officeCode
FROM offices
LEFT JOIN employees
USING (officeCode)
WHERE offices.officeCode = "1"


;

""").fetchall())
df.columns = [x[0] for x in c.description]
df

  employeeNumber   lastName firstName officeCode officeCode
0           1002     Murphy     Diane          1          1
1           1056  Patterson      Mary          1          1
2           1076   Firrelli      Jeff          1          1
3           1143        Bow   Anthony          1          1
4           1165   Jennings    Leslie          1          1
5           1166   Thompson    Leslie          1          1

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [108]:
# Your code here
df = pd.DataFrame(c.execute("""
SELECT *
FROM customers

LIMIT 5

;

""").fetchall())
df.columns = [x[0] for x in c.description]
df

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",,Nantes,,44000,France,1370,21000.00
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,,Las Vegas,NV,83030,USA,1166,71800.00
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611,117300.00
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",,Nantes,,44000,France,1370,118200.00
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,,Stavern,,4110,Norway,1504,81700.00

In [ ]:
SELECT employees.employeeNumber, count(customers.customerNumber) as custNum

In [143]:
# Your code here
df = pd.DataFrame(c.execute("""

SELECT employees.employeeNumber, employees.firstName, employees.lastName, productName, priceEach, MSRP
FROM employees
JOIN customers
ON employees.employeeNumber = customers.salesRepEmployeeNumber
JOIN orders
USING (customerNumber)
JOIN orderdetails
USING (orderNumber)
JOIN products
USING (productCode)

;

""").fetchall())
df.columns = [x[0] for x in c.description]
df

,employeeNumber,firstName,lastName,productName,priceEach,MSRP
0,1165,Leslie,Jennings,1958 Setra Bus,121.64,136.67
1,1165,Leslie,Jennings,1940 Ford Pickup Truck,101.50,116.67
2,1165,Leslie,Jennings,1939 Cadillac Limousine,43.27,50.31
3,1165,Leslie,Jennings,1996 Peterbilt 379 Stake Bed with Outrigger,58.82,64.64
4,1165,Leslie,Jennings,1968 Ford Mustang,173.17,194.57
5,1165,Leslie,Jennings,1968 Dodge Charger,110.39,117.44
6,1165,Leslie,Jennings,1970 Plymouth Hemi Cuda,72.62,79.80
7,1165,Leslie,Jennings,1969 Dodge Charger,103.64,115.16
8,1165,Leslie,Jennings,1948 Porsche 356-A Roadster,66.99,77.00
9,1165,Leslie,Jennings,1969 Dodge Super Bee,65.94,80.41
10,1165,Leslie,Jennings,1976 Ford Gran Torino,139.64,146.99
11,1165,Leslie,Jennings,1957 Vespa GS150,49.74,62.17
12,1165,Leslie,Jennings,1957 Corvette Convertible,133.92,148.80
13,1165,Leslie,Jennings,1982 Ducati 900 Monster,67.18,69.26
14,1165,Leslie,Jennings,1982 Lamborghini Diablo,34.36,37.76
15,1165,Leslie,Jennings,1971 Alpine Renault 1600s,52.05,61.23
16,1165,Leslie,Jennings,1956 Porsche 356A Coupe,139.03,140.43
17,1165,Leslie,Jennings,1961 Chevrolet Impala,76.80,80.84
18,1165,Leslie,Jennings,1982 Ducati 996 R,38.62,40.23
19,1165,Leslie,Jennings,1974 Ducati 350 Mk3 Desmo,91.85,102.05
20,1165,Leslie,Jennings,2002 Yamaha YZR M1,78.92,81.36
21,1165,Leslie,Jennings,2001 Ferrari Enzo,166.24,207.80
22,1165,Leslie,Jennings,1969 Corvair Monza,140.50,151.08
23,1165,Leslie,Jennings,1969 Ford Falcon,167.83,173.02
24,1165,Leslie,Jennings,1903 Ford Model A,129.76,136.59
25,1165,Leslie,Jennings,Collectable Wooden Train,95.80,100.84
26,1165,Leslie,Jennings,1970 Triumph Spitfire,122.08,143.62
27,1165,Leslie,Jennings,1904 Buick Runabout,79.87,87.77
28,1165,Leslie,Jennings,18th century schooner,114.29,122.89
29,1165,Leslie,Jennings,1912 Ford Model T Delivery Wagon,74.35,88.51
...,...,...,...,...,...,...
2966,1702,Martin,Gerard,1917 Grand Touring Sedan,166.60,170.00
2967,1702,Martin,Gerard,1911 Ford Town Car,53.28,60.54
2968,1702,Martin,Gerard,1932 Model A Ford J-Coupe,125.86,127.13
2969,1702,Martin,Gerard,1928 Mercedes-Benz SSK,167.06,168.75
2970,1702,Martin,Gerard,1939 Chevrolet Deluxe Coupe,32.19,33.19
2971,1702,Martin,Gerard,1938 Cadillac V-16 Presidential Limousine,39.87,44.80
2972,1702,Martin,Gerard,1936 Mercedes Benz 500k Roadster,38.57,41.03
2973,1702,Martin,Gerard,2001 Ferrari Enzo,207.80,207.80
2974,1702,Martin,Gerard,1969 Corvair Monza,122.37,151.08
2975,1702,Martin,Gerard,1939 Cadillac Limousine,43.77,50.31
2976,1702,Martin,Gerard,1962 Volkswagen Microbus,107.34,127.79
2977,1702,Martin,Gerard,1936 Chrysler Airflow,82.78,97.39
2978,1702,Martin,Gerard,1980â€™s GM Manhattan Express,90.53,96.31
2979,1702,Martin,Gerard,1996 Peterbilt 379 Stake Bed with Outrigger,62.70,64.64
2980,1702,Martin,Gerard,1982 Camaro Z28,100.14,101.15
2981,1702,Martin,Gerard,1957 Chevy Pickup,105.47,118.50
2982,1702,Martin,Gerard,1998 Chrysler Plymouth Prowler,145.72,163.73
2983,1702,Martin,Gerard,1964 Mercedes Tour Bus,119.05,122.73
2984,1702,Martin,Gerard,1926 Ford Fire Engine,60.77,60.77
2985,1702,Martin,Gerard,1992 Ferrari 360 Spider red,165.95,169.34
2986,1702,Martin,Gerard,1970 Dodge Coronet,57.22,57.80
2987,1702,Martin,Gerard,1962 Volkswagen Microbus,117.57,127.79
2988,1702,Martin,Gerard,1958 Chevy Corvette Limited Edition,30.06,35.36
2989,1702,Martin,Gerard,1992 Porsche Cayenne Turbo Silver,114.73,118.28
2990,1702,Martin,Gerard,1980â€™s GM Manhattan Express,84.75,96.31
2991,1702,Martin,Gerard,1954 Greyhound Scenicruiser,52.49,54.11
2992,1702,Martin,Gerard,1950's Chicago Surface Lines Streetcar,59.03,62.14
2993,1702,Martin,Gerard,Diamond T620 Semi-Skirted Tanker,92.60,115.75
2994,1702,Martin,Gerard,1911 Ford Town Car,56.91,60.54
2995,1702,Martin,Gerard,1936 Mercedes Benz 500k Roadster,35.70,41.03

## Level Up: Display the Number of Products each employee has sold

In [ ]:
# Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!